#include <iostream>

using namespace std;

int main()
{
	//Задание-4

	extern int a, b, c, d; //берем данные из другого модуля global.cpp
	cout << "Task-4" << endl;
	float sum = a * (b + (static_cast <float> (c) / d));
	cout << "sum = " << sum << endl;

	//Задание-2

	cout << "\nTask-2" << endl;
	int e3, f3;
	cout << "Enter random integer number:" << endl;
	cin >> e3; //переменная для ввода пользователем
	if (e3 <= 21) //первое условие, если введенное число <= 21
	{
		cout << "Your number: " << e3 << endl;
		f3 = e3 <= 21 ? e3 - 21 : (e3 - 21) * 2;
		cout << e3 << " <= 21, " << e3 << " - 21 = " << f3 << endl;
	}
	else if (e3 > 21) //второе условие, если введенное число больше 21
	{
		cout << "Your number: " << e3 << endl;
		f3 = e3 <= 21 ? e3 - 21 : (e3 - 21) * 2;
		cout << e3 << " > 21, (" << e3 << " - 21) * 2 = " << f3 << endl;
	}

	//задание 3

	cout << "\nTask-3" << endl;
	int Arr[3][3][3] = { { {1, 2, 3}, {4, 5, 6}, {7, 8, 9} }, //инициализируем трехменый массив
					   { {10, 11, 12}, {13, 14, 15}, {16, 17, 18} } ,
					   { {19, 20, 21}, { 22, 23, 24 }, { 25, 26, 27 } } };
	cout << "Arr[1][1][1] = " << Arr[1][1][1] << endl; //выводим изначальное значение координаты
	int* pArr;
	pArr = &Arr[1][1][1]; //адресс элемента массива записываем в pArr
	*pArr = 50; //меняем значение Arr[1][1][1] с 14 на 50
	cout << "Arr[1][1][1] = " << Arr[1][1][1] << endl; // значение полученное после разыменовывания

	return 0;
}